; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=190, out_folder=./training, instance_id=7, seed=2031, goal_proportion=0.03

(define (problem blocksworld-07)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 - object)
 (:init 
    (arm-empty)
    (clear b26)
    (on b26 b93)
    (on-table b93)
    (clear b58)
    (on b58 b74)
    (on b74 b40)
    (on b40 b188)
    (on-table b188)
    (clear b112)
    (on b112 b2)
    (on b2 b151)
    (on-table b151)
    (clear b34)
    (on b34 b119)
    (on b119 b42)
    (on-table b42)
    (clear b101)
    (on b101 b156)
    (on b156 b65)
    (on b65 b36)
    (on b36 b165)
    (on b165 b41)
    (on b41 b148)
    (on b148 b125)
    (on b125 b96)
    (on b96 b9)
    (on-table b9)
    (clear b94)
    (on b94 b147)
    (on b147 b37)
    (on b37 b122)
    (on b122 b61)
    (on-table b61)
    (clear b80)
    (on b80 b105)
    (on b105 b135)
    (on b135 b17)
    (on b17 b29)
    (on-table b29)
    (clear b107)
    (on b107 b91)
    (on-table b91)
    (clear b45)
    (on b45 b144)
    (on b144 b145)
    (on b145 b102)
    (on-table b102)
    (clear b104)
    (on b104 b38)
    (on b38 b150)
    (on b150 b63)
    (on b63 b174)
    (on b174 b76)
    (on b76 b86)
    (on b86 b132)
    (on b132 b127)
    (on b127 b67)
    (on b67 b16)
    (on-table b16)
    (clear b128)
    (on b128 b113)
    (on b113 b129)
    (on-table b129)
    (clear b140)
    (on-table b140)
    (clear b170)
    (on b170 b116)
    (on b116 b131)
    (on b131 b39)
    (on b39 b6)
    (on b6 b24)
    (on b24 b186)
    (on b186 b22)
    (on b22 b90)
    (on b90 b115)
    (on b115 b169)
    (on b169 b98)
    (on b98 b20)
    (on-table b20)
    (clear b81)
    (on b81 b142)
    (on b142 b49)
    (on b49 b7)
    (on-table b7)
    (clear b138)
    (on-table b138)
    (clear b126)
    (on b126 b158)
    (on-table b158)
    (clear b133)
    (on b133 b33)
    (on-table b33)
    (clear b180)
    (on-table b180)
    (clear b161)
    (on b161 b179)
    (on b179 b53)
    (on b53 b59)
    (on-table b59)
    (clear b178)
    (on b178 b66)
    (on-table b66)
    (clear b75)
    (on-table b75)
    (clear b28)
    (on b28 b68)
    (on b68 b185)
    (on b185 b84)
    (on b84 b32)
    (on-table b32)
    (clear b183)
    (on b183 b184)
    (on-table b184)
    (clear b120)
    (on b120 b4)
    (on-table b4)
    (clear b19)
    (on b19 b64)
    (on b64 b12)
    (on-table b12)
    (clear b48)
    (on b48 b14)
    (on b14 b189)
    (on b189 b162)
    (on b162 b100)
    (on-table b100)
    (clear b89)
    (on b89 b44)
    (on-table b44)
    (clear b13)
    (on b13 b88)
    (on b88 b10)
    (on b10 b160)
    (on b160 b176)
    (on b176 b190)
    (on b190 b27)
    (on b27 b54)
    (on b54 b25)
    (on-table b25)
    (clear b109)
    (on b109 b177)
    (on b177 b164)
    (on b164 b153)
    (on b153 b78)
    (on b78 b30)
    (on b30 b92)
    (on b92 b8)
    (on b8 b83)
    (on b83 b154)
    (on b154 b117)
    (on b117 b172)
    (on b172 b82)
    (on b82 b136)
    (on b136 b47)
    (on b47 b157)
    (on b157 b21)
    (on b21 b124)
    (on b124 b121)
    (on b121 b55)
    (on b55 b52)
    (on b52 b69)
    (on b69 b181)
    (on b181 b77)
    (on-table b77)
    (clear b137)
    (on b137 b79)
    (on b79 b139)
    (on b139 b166)
    (on-table b166)
    (clear b152)
    (on b152 b168)
    (on b168 b1)
    (on b1 b97)
    (on b97 b134)
    (on b134 b143)
    (on-table b143)
    (clear b130)
    (on-table b130)
    (clear b62)
    (on b62 b35)
    (on b35 b5)
    (on b5 b23)
    (on b23 b3)
    (on b3 b163)
    (on b163 b99)
    (on-table b99)
    (clear b155)
    (on b155 b167)
    (on-table b167)
    (clear b175)
    (on b175 b159)
    (on b159 b56)
    (on-table b56)
    (clear b87)
    (on b87 b31)
    (on b31 b72)
    (on b72 b110)
    (on-table b110)
    (clear b60)
    (on b60 b111)
    (on b111 b108)
    (on-table b108)
    (clear b11)
    (on b11 b187)
    (on-table b187)
    (clear b146)
    (on b146 b182)
    (on b182 b70)
    (on b70 b15)
    (on b15 b106)
    (on b106 b173)
    (on b173 b50)
    (on-table b50)
    (clear b43)
    (on b43 b141)
    (on-table b141)
    (clear b18)
    (on b18 b103)
    (on b103 b73)
    (on b73 b123)
    (on b123 b57)
    (on b57 b51)
    (on b51 b149)
    (on b149 b114)
    (on b114 b118)
    (on-table b118)
    (clear b71)
    (on b71 b95)
    (on b95 b85)
    (on b85 b46)
    (on b46 b171)
    (on-table b171))
 (:goal  (and 
    (clear b3)
    (on b3 b1)
    (on b1 b2)
    (on b2 b4)
    (on b4 b5)
    (on-table b5))))

; plan
1. (unstack b112 b2)
   deleted: (on b112 b2) (clear b112) (arm-empty)
   added: (holding b112) (clear b2)
   goals met: 0 of 6
2. (putdown b112)
   deleted: (holding b112)
   added: (clear b112) (arm-empty) (on-table b112)
   goals met: 0 of 6
3. (unstack b120 b4)
   deleted: (on b120 b4) (clear b120) (arm-empty)
   added: (holding b120) (clear b4)
   goals met: 0 of 6
4. (putdown b120)
   deleted: (holding b120)
   added: (clear b120) (arm-empty) (on-table b120)
   goals met: 0 of 6
5. (unstack b152 b168)
   deleted: (on b152 b168) (clear b152) (arm-empty)
   added: (holding b152) (clear b168)
   goals met: 0 of 6
6. (putdown b152)
   deleted: (holding b152)
   added: (clear b152) (arm-empty) (on-table b152)
   goals met: 0 of 6
7. (unstack b168 b1)
   deleted: (on b168 b1) (clear b168) (arm-empty)
   added: (holding b168) (clear b1)
   goals met: 0 of 6
8. (putdown b168)
   deleted: (holding b168)
   added: (clear b168) (arm-empty) (on-table b168)
   goals met: 0 of 6
9. (unstack b62 b35)
   deleted: (on b62 b35) (clear b62) (arm-empty)
   added: (holding b62) (clear b35)
   goals met: 0 of 6
10. (putdown b62)
   deleted: (holding b62)
   added: (clear b62) (arm-empty) (on-table b62)
   goals met: 0 of 6
11. (unstack b35 b5)
   deleted: (on b35 b5) (clear b35) (arm-empty)
   added: (holding b35) (clear b5)
   goals met: 0 of 6
12. (putdown b35)
   deleted: (holding b35)
   added: (clear b35) (arm-empty) (on-table b35)
   goals met: 0 of 6
13. (unstack b5 b23)
   deleted: (on b5 b23) (clear b5) (arm-empty)
   added: (holding b5) (clear b23)
   goals met: 0 of 6
14. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 1 of 6
15. (unstack b23 b3)
   deleted: (on b23 b3) (clear b23) (arm-empty)
   added: (holding b23) (clear b3)
   goals met: 2 of 6
16. (putdown b23)
   deleted: (holding b23)
   added: (clear b23) (arm-empty) (on-table b23)
   goals met: 2 of 6
17. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 2 of 6
18. (stack b4 b5)
   deleted: (clear b5) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b5)
   goals met: 3 of 6
19. (unstack b2 b151)
   deleted: (on b2 b151) (clear b2) (arm-empty)
   added: (holding b2) (clear b151)
   goals met: 3 of 6
20. (stack b2 b4)
   deleted: (clear b4) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b4)
   goals met: 4 of 6
21. (unstack b1 b97)
   deleted: (on b1 b97) (clear b1) (arm-empty)
   added: (holding b1) (clear b97)
   goals met: 4 of 6
22. (stack b1 b2)
   deleted: (clear b2) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b2)
   goals met: 5 of 6
23. (unstack b3 b163)
   deleted: (on b3 b163) (clear b3) (arm-empty)
   added: (holding b3) (clear b163)
   goals met: 4 of 6
24. (stack b3 b1)
   deleted: (clear b1) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b1)
   goals met: 6 of 6
